<a href="https://colab.research.google.com/github/Chekuru-Ravi/hello-world/blob/master/2_DataFrames.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy  as np
import pandas as pd

In [ ]:
data = {"name":["Bill","Tom","Tim","John","Alex","Vanessa","Kate"],
       "score":[90,80,85,75,95,60,65],
       "sport":["Wrestling","Football","Skiing","Swimming","Tennis",
               "Karete","Surfing"],
       "sex":["M","M","M","M","F","F","F"]}

In [ ]:
type(data)

dict

In [ ]:
df = pd.DataFrame(data)
df
# indexes are automatically added!

      name  score      sport sex
0     Bill     90  Wrestling   M
1      Tom     80   Football   M
2      Tim     85     Skiing   M
3     John     75   Swimming   M
4     Alex     95     Tennis   F
5  Vanessa     60     Karete   F
6     Kate     65    Surfing   F

In [ ]:
df.head() # by default : first 5 rows of the data

   name  score      sport sex
0  Bill     90  Wrestling   M
1   Tom     80   Football   M
2   Tim     85     Skiing   M
3  John     75   Swimming   M
4  Alex     95     Tennis   F

In [ ]:
df.head(2) # first 2 rows of the data

   name  score      sport sex
0  Bill     90  Wrestling   M
1   Tom     80   Football   M

In [ ]:
df.tail() # by default : last 5 rows of the data

      name  score     sport sex
2      Tim     85    Skiing   M
3     John     75  Swimming   M
4     Alex     95    Tennis   F
5  Vanessa     60    Karete   F
6     Kate     65   Surfing   F

In [ ]:
df.tail(2) # last 2 rows of the data

      name  score    sport sex
5  Vanessa     60   Karete   F
6     Kate     65  Surfing   F

In [ ]:
df.shape # rows, columns

(7, 4)

In [ ]:
df.columns

Index(['name', 'score', 'sport', 'sex'], dtype='object')

In [ ]:
df

      name  score      sport sex
0     Bill     90  Wrestling   M
1      Tom     80   Football   M
2      Tim     85     Skiing   M
3     John     75   Swimming   M
4     Alex     95     Tennis   F
5  Vanessa     60     Karete   F
6     Kate     65    Surfing   F

In [ ]:
# access 1 columns :
df['name']

0       Bill
1        Tom
2        Tim
3       John
4       Alex
5    Vanessa
6       Kate
Name: name, dtype: object

In [ ]:
# access 2 / 2+ columns :
df[['name','sport','sex']]

      name      sport sex
0     Bill  Wrestling   M
1      Tom   Football   M
2      Tim     Skiing   M
3     John   Swimming   M
4     Alex     Tennis   F
5  Vanessa     Karete   F
6     Kate    Surfing   F

In [ ]:
data

{'name': ['Bill', 'Tom', 'Tim', 'John', 'Alex', 'Vanessa', 'Kate'],
 'score': [90, 80, 85, 75, 95, 60, 65],
 'sport': ['Wrestling',
  'Football',
  'Skiing',
  'Swimming',
  'Tennis',
  'Karete',
  'Surfing'],
 'sex': ['M', 'M', 'M', 'M', 'F', 'F', 'F']}

In [ ]:
df=pd.DataFrame(data,columns=["name", "sport",
                              "score",
                              "sex"],
                index=["one","two","three","four",
                       "five","six","seven"])

In [ ]:
df

          name      sport  score sex
one       Bill  Wrestling     90   M
two        Tom   Football     80   M
three      Tim     Skiing     85   M
four      John   Swimming     75   M
five      Alex     Tennis     95   F
six    Vanessa     Karete     60   F
seven     Kate    Surfing     65   F

In [ ]:
df.reset_index() # i. default index | ii. old index became a new column

   index     name      sport  score sex
0    one     Bill  Wrestling     90   M
1    two      Tom   Football     80   M
2  three      Tim     Skiing     85   M
3   four     John   Swimming     75   M
4   five     Alex     Tennis     95   F
5    six  Vanessa     Karete     60   F
6  seven     Kate    Surfing     65   F

In [ ]:
df.reset_index(drop=True) # drop old index

      name      sport  score sex
0     Bill  Wrestling     90   M
1      Tom   Football     80   M
2      Tim     Skiing     85   M
3     John   Swimming     75   M
4     Alex     Tennis     95   F
5  Vanessa     Karete     60   F
6     Kate    Surfing     65   F

In [ ]:
df.head()
# 1. original table --> Correct!
# 2. table with both old and new index
# 3. table with only new index

       name      sport  score sex
one    Bill  Wrestling     90   M
two     Tom   Football     80   M
three   Tim     Skiing     85   M
four   John   Swimming     75   M
five   Alex     Tennis     95   F

In [ ]:
# 2 ways to save the operation
# i. df = df.reset_index(drop=True)

In [ ]:
# ii. inplace = True
df.reset_index(drop=True, inplace=True)

In [ ]:
df.head()

   name      sport  score sex
0  Bill  Wrestling     90   M
1   Tom   Football     80   M
2   Tim     Skiing     85   M
3  John   Swimming     75   M
4  Alex     Tennis     95   F

In [ ]:
# df.reset_index()
# df.reset_index(drop=True)
# df.reset_index(drop=True, inplace = True)
# df2 = df.reset_index(drop=True)

In [ ]:
df

      name      sport  score sex
0     Bill  Wrestling     90   M
1      Tom   Football     80   M
2      Tim     Skiing     85   M
3     John   Swimming     75   M
4     Alex     Tennis     95   F
5  Vanessa     Karete     60   F
6     Kate    Surfing     65   F

In [ ]:
df.set_index("name",inplace=True)

In [ ]:
df

             sport  score sex
name
Bill     Wrestling     90   M
Tom       Football     80   M
Tim         Skiing     85   M
John      Swimming     75   M
Alex        Tennis     95   F
Vanessa     Karete     60   F
Kate       Surfing     65   F